Documents/ОбучениеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ОбучениеСотрудников</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбученийСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПервичногоОбученияСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаОбучения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПроверкиЗнаний</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПроверкиЗнаний</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбучающиеРесурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОбучающийРесурс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДолжностныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДолжностныеЛицаОрганизаций</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДолжностногоЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДолжностныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсполняющийОбязанности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ОбучениеСотрудников/Ext/ManagerModule.bsl
Функция СформироватьЛистУчетаОбучения(Ссылка, Сотрудник) Экспорт
	
	Если Метаданные.Документы.ОбучениеСотрудников.Макеты.Найти("ЛистУчетаОбучения_" + Ссылка.ВидПеречня.ИмяПредопределенныхДанных) = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Для перечня %1 не предусмотрена печать листа обучения", Ссылка.ВидПеречня));
		Возврат Неопределено;
		
	Иначе
		ИмяМакета = "ЛистУчетаОбучения_" + Ссылка.ВидПеречня.ИмяПредопределенныхДанных;
		
	КонецЕсли;	
	
	ОтборПоСотруднику = (ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Сотрудники"));	
	
	Макет = ПолучитьМакет(ИмяМакета + Формат(ОтборПоСотруднику, "БЛ=; БИ=_ПоСотруднику"));
	
	Результат = Новый ТабличныйДокумент;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	ПоместитьТаблицыЛистаОбученияВМенеджерВременныхТаблиц(МВТ, Ссылка, Сотрудник);
	
	Таблица_Шапка				= МВТ.Таблицы.Найти("_Шапка").ПолучитьДанные().Выгрузить();
	Таблица_ЛистУчетаОбучения	= МВТ.Таблицы.Найти("_ЛистУчетаОбучения").ПолучитьДанные().Выгрузить();
	Таблица_ЛистУчетаОбучения.Сортировать("ФИОСотрудника");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	
	Для Каждого Строка_Шапка Из Таблица_Шапка Цикл
		Результат.ИспользуемоеИмяФайла	= СтрШаблон("Лист учёта обучения № %1 от %2", Строка_Шапка.Номер, Формат(Строка_Шапка.Дата, "ДФ=dd.MM.yyyy"));
		ОбластьШапка.Параметры.Заполнить(Строка_Шапка);
		
		Если Макет.Области.Найти("Строка") = Неопределено И Таблица_ЛистУчетаОбучения.Количество() Тогда
			ОбластьШапка.Параметры.Заполнить(Таблица_ЛистУчетаОбучения[0]);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Вывести(ОбластьШапка);
	
	Если Макет.Области.Найти("Строка") <> Неопределено Тогда
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");	
		
		Для Каждого Строка_ЛистУчетаОбучения Из Таблица_ЛистУчетаОбучения Цикл
			Строка_ЛистУчетаОбучения.НомерСтроки = Таблица_ЛистУчетаОбучения.Индекс(Строка_ЛистУчетаОбучения) + 1;
			ОбластьСтрока.Параметры.Заполнить(Строка_ЛистУчетаОбучения);
			Результат.Вывести(ОбластьСтрока);
		КонецЦикла;	
		
	КонецЕсли;
	
	Если Макет.Области.Найти("Подвал") <> Неопределено Тогда
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		Результат.Вывести(ОбластьПодвал);
	КонецЕсли;
	
	Результат.ТолькоПросмотр		= Истина;
	Результат.ОтображатьСетку		= Ложь;
	Результат.ОтображатьЗаголовки	= Ложь;
	Результат.АвтоМасштаб			= Истина;
	
	Если ОтборПоСотруднику Тогда
		Результат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;	
	Иначе
		Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Помещает таблицы с данными листа обучения в источник временных таблиц
//
// Параметры
//	ИсточникВременныхТаблиц	- Запрос, МенеджерВременныхТаблиц	- источник временных таблиц
//	Ссылка					- ДокументСсылка.ОбучениеСотрудников- Ссылка на документ Обучение сотрудников
//	Сотрудник				- СправочникСсылка.Сотруднки, Неопределено	- Значение отбора по сотруднику, Неопределено - без отбора
//	
Процедура ПоместитьТаблицыЛистаОбученияВМенеджерВременныхТаблиц(ИсточникВременныхТаблиц, Ссылка, Сотрудник, Задача = Неопределено) Экспорт
	
	МенеджерВременныхТаблиц = ?(ТипЗнч(ИсточникВременныхТаблиц) = Тип("МенеджерВременныхТаблиц"), ИсточникВременныхТаблиц, ИсточникВременныхТаблиц.МенеджерВременныхТаблиц);
	
 	ВидДолжностногоЛица = ПолучитьВидДолжностногоЛицаОтветственногоЗаОбучение(Ссылка.ВидПеречня, Ложь);
	
	Если ВидДолжностногоЛица = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
	Запрос.УстановитьПараметр("Дата",	 				Ссылка.Дата);
	Запрос.УстановитьПараметр("Организация",			Ссылка.Организация);
	Запрос.УстановитьПараметр("Дата",	 				Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДолжностногоЛица",	ВидДолжностногоЛица);
	Запрос.УстановитьПараметр("ОтборПоСотруднику",		ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Сотрудники"));
	Запрос.УстановитьПараметр("Сотрудник",				Сотрудник);
	Запрос.УстановитьПараметр("Задача",					Задача);
	Запрос.УстановитьПараметр("ТекущаяДата",			ТекущаяДата());
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбучениеСотрудниковСотрудники.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ЗадачаНаОбучение.ДатаВыполнения <> ДАТАВРЕМЯ(1,1,1)
		|			ТОГДА ЗадачаНаОбучение.ДатаВыполнения
		|		КОГДА ЗадачаНаОбучение.ДатаВыполнения ЕСТЬ НЕ NULL 
		|			ТОГДА &ТекущаяДата
		|	КОНЕЦ КАК ДатаОбучения,
		|	ВЫБОР
		|		КОГДА ЗадачаНаПроверкуЗнаний.ДатаВыполнения <> ДАТАВРЕМЯ(1,1,1)
		|			ТОГДА ЗадачаНаПроверкуЗнаний.ДатаВыполнения
		|		КОГДА ЗадачаНаПроверкуЗнаний.ДатаВыполнения ЕСТЬ НЕ NULL 
		|			ТОГДА &ТекущаяДата
		|	КОНЕЦ КАК ДатаПроверкиЗнаний,
		|	ВЫБОР
		|		КОГДА ЗадачаНаПроверкуЗнаний.ДатаВыполнения <> ДАТАВРЕМЯ(1,1,1)
		|			ТОГДА ЗадачаНаПроверкуЗнаний.ДатаВыполнения
		|		КОГДА ЗадачаНаПроверкуЗнаний.ДатаВыполнения ЕСТЬ НЕ NULL 
		|			ТОГДА &ТекущаяДата
		|		КОГДА ЗадачаНаОбучение.ДатаВыполнения <> ДАТАВРЕМЯ(1,1,1)
		|			ТОГДА ЗадачаНаОбучение.ДатаВыполнения
		|		КОГДА ЗадачаНаОбучение.ДатаВыполнения ЕСТЬ НЕ NULL 
		|			ТОГДА &ТекущаяДата
		|		ИНАЧЕ ОбучениеСотрудниковСотрудники.Ссылка.Дата
		|	КОНЕЦ КАК ДатаРеквизитов
		|ПОМЕСТИТЬ _ДатыОбученияСотрудников
		|ИЗ
		|	Документ.ОбучениеСотрудников.Сотрудники КАК ОбучениеСотрудниковСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.ОбучениеСотрудника КАК ОбучениеСотрудника
		|		ПО ОбучениеСотрудниковСотрудники.Сотрудник = ОбучениеСотрудника.Сотрудник
		|			И ОбучениеСотрудниковСотрудники.Ссылка = ОбучениеСотрудника.Основание
		|			И (НЕ ОбучениеСотрудника.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаИсполнителя КАК ЗадачаНаОбучение
		|		ПО (ОбучениеСотрудника.Ссылка = ЗадачаНаОбучение.БизнесПроцесс)
		|			И (ЗадачаНаОбучение.ТочкаМаршрута В (ЗНАЧЕНИЕ(БизнесПроцесс.ОбучениеСотрудника.ТочкаМаршрута.ПройтиОбучение), ЗНАЧЕНИЕ(БизнесПроцесс.ОбучениеСотрудника.ТочкаМаршрута.ПровестиОбучение)))
		|			И (ЗадачаНаОбучение.Ссылка = &Задача
		|				ИЛИ НЕ ЗадачаНаОбучение.ПометкаУдаления
		|					И ЗадачаНаОбучение.Выполнена)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаИсполнителя КАК ЗадачаНаПроверкуЗнаний
		|		ПО (ОбучениеСотрудника.Ссылка = ЗадачаНаПроверкуЗнаний.БизнесПроцесс)
		|			И (ЗадачаНаПроверкуЗнаний.ТочкаМаршрута = ЗНАЧЕНИЕ(БизнесПроцесс.ОбучениеСотрудника.ТочкаМаршрута.ПроверитьЗнания))
		|			И (ЗадачаНаПроверкуЗнаний.Ссылка = &Задача
		|				ИЛИ НЕ ЗадачаНаПроверкуЗнаний.ПометкаУдаления
		|					И ЗадачаНаПроверкуЗнаний.Выполнена)
		|ГДЕ
		|	ОбучениеСотрудниковСотрудники.Ссылка = &Ссылка
		|	И (&ОтборПоСотруднику = ЛОЖЬ
		|			ИЛИ ОбучениеСотрудниковСотрудники.Сотрудник = &Сотрудник)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДолжностныеЛицаОрганизаций.Период КАК Период,
		|	ДолжностныеЛицаОрганизаций.ИсполняющийОбязанности КАК ИО,
		|	ДолжностныеЛицаОрганизаций.Сотрудник КАК Сотрудник,
		|	ДолжностныеЛицаОрганизаций.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ _ДолжностныеЛица
		|ИЗ
		|	РегистрСведений.ДолжностныеЛицаОрганизаций КАК ДолжностныеЛицаОрганизаций
		|ГДЕ
		|	ДолжностныеЛицаОрганизаций.Активность
		|	И ДолжностныеЛицаОрганизаций.Организация = &Организация
		|	И ДолжностныеЛицаОрганизаций.ВидДолжностногоЛица = &ВидДолжностногоЛица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РеквизитыСотрудников.Период КАК Период,
		|	_ДатыОбученияСотрудников.Сотрудник КАК Сотрудник,
		|	РеквизитыСотрудников.Фамилия КАК Фамилия,
		|	РеквизитыСотрудников.Имя КАК Имя,
		|	РеквизитыСотрудников.Отчество КАК Отчество,
		|	РеквизитыСотрудников.Фамилия + "" "" + РеквизитыСотрудников.Имя + "" "" + РеквизитыСотрудников.Отчество КАК ФИО
		|ПОМЕСТИТЬ _РеквизитыСотрудников
		|ИЗ
		|	_ДатыОбученияСотрудников КАК _ДатыОбученияСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации КАК РеквизитыСотрудников
		|		ПО _ДатыОбученияСотрудников.Сотрудник.ЮрФизЛицо = РеквизитыСотрудников.ЮрФизЛицо
		|			И (РеквизитыСотрудников.Организация = &Организация)
		|			И (РеквизитыСотрудников.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеквизитыСотрудников.Период,
		|	_ДолжностныеЛица.Сотрудник,
		|	РеквизитыСотрудников.Фамилия,
		|	РеквизитыСотрудников.Имя,
		|	РеквизитыСотрудников.Отчество,
		|	РеквизитыСотрудников.Фамилия + "" "" + РеквизитыСотрудников.Имя + "" "" + РеквизитыСотрудников.Отчество
		|ИЗ
		|	_ДолжностныеЛица КАК _ДолжностныеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации КАК РеквизитыСотрудников
		|		ПО _ДолжностныеЛица.Сотрудник.ЮрФизЛицо = РеквизитыСотрудников.ЮрФизЛицо
		|			И (РеквизитыСотрудников.Организация = &Организация)
		|			И (РеквизитыСотрудников.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПериодыДолжностныхЛиц.Сотрудник КАК Сотрудник,
		|	ПериодыДолжностныхЛиц.ДатаОбучения КАК ДатаОбучения,
		|	ПериодыДолжностныхЛиц.ДатаПроверкиЗнаний КАК ДатаПроверкиЗнаний,
		|	ПериодыДолжностныхЛиц.ДатаРеквизитов КАК ДатаРеквизитов,
		|	ЕСТЬNULL(ДолжностныеЛицаОбучениеИО.Сотрудник, ДолжностныеЛицаОбучение.Сотрудник) КАК ДолжностноеЛицоОбучение,
		|	ЕСТЬNULL(ДолжностныеЛицаПроверкаЗнанийИО.Сотрудник, ДолжностныеЛицаПроверкаЗнаний.Сотрудник) КАК ДолжностноеЛицоПроверкаЗнаний
		|ПОМЕСТИТЬ _ДолжностныеЛицаОбученияСотрудников
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДатыОбученияСотрудников.Сотрудник КАК Сотрудник,
		|		_ДатыОбученияСотрудников.ДатаОбучения КАК ДатаОбучения,
		|		_ДатыОбученияСотрудников.ДатаПроверкиЗнаний КАК ДатаПроверкиЗнаний,
		|		_ДатыОбученияСотрудников.ДатаРеквизитов КАК ДатаРеквизитов,
		|		МАКСИМУМ(ДолжностныеЛицаОбучение.Период) КАК ДолжностныеЛицаОбучениеПериод,
		|		МАКСИМУМ(ДолжностныеЛицаОбучениеИО.Период) КАК ДолжностныеЛицаОбучениеИОПериод,
		|		МАКСИМУМ(ДолжностныеЛицаПроверкаЗнаний.Период) КАК ДолжностныеЛицаПроверкаЗнанийПериод,
		|		МАКСИМУМ(ДолжностныеЛицаПроверкаЗнанийИО.Период) КАК ДолжностныеЛицаПроверкаЗнанийИОПериод
		|	ИЗ
		|		_ДатыОбученияСотрудников КАК _ДатыОбученияСотрудников
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ДолжностныеЛица КАК ДолжностныеЛицаОбучение
		|			ПО _ДатыОбученияСотрудников.ДатаОбучения >= ДолжностныеЛицаОбучение.Период
		|				И (НЕ ДолжностныеЛицаОбучение.ИО)
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ДолжностныеЛица КАК ДолжностныеЛицаОбучениеИО
		|			ПО _ДатыОбученияСотрудников.ДатаОбучения >= ДолжностныеЛицаОбучениеИО.Период
		|				И (ДолжностныеЛицаОбучениеИО.ИО)
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ДолжностныеЛица КАК ДолжностныеЛицаПроверкаЗнаний
		|			ПО _ДатыОбученияСотрудников.ДатаПроверкиЗнаний >= ДолжностныеЛицаПроверкаЗнаний.Период
		|				И (НЕ ДолжностныеЛицаПроверкаЗнаний.ИО)
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ДолжностныеЛица КАК ДолжностныеЛицаПроверкаЗнанийИО
		|			ПО _ДатыОбученияСотрудников.ДатаПроверкиЗнаний >= ДолжностныеЛицаПроверкаЗнанийИО.Период
		|				И (ДолжностныеЛицаПроверкаЗнанийИО.ИО)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ДатыОбученияСотрудников.Сотрудник,
		|		_ДатыОбученияСотрудников.ДатаОбучения,
		|		_ДатыОбученияСотрудников.ДатаПроверкиЗнаний,
		|		_ДатыОбученияСотрудников.ДатаРеквизитов) КАК ПериодыДолжностныхЛиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДолжностныеЛица КАК ДолжностныеЛицаОбучение
		|		ПО ПериодыДолжностныхЛиц.ДолжностныеЛицаОбучениеПериод = ДолжностныеЛицаОбучение.Период
		|			И (НЕ ДолжностныеЛицаОбучение.ИО)
		|			И (ДолжностныеЛицаОбучение.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДолжностныеЛицаОбучение.ДатаОкончания >= ПериодыДолжностныхЛиц.ДатаОбучения)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДолжностныеЛица КАК ДолжностныеЛицаОбучениеИО
		|		ПО ПериодыДолжностныхЛиц.ДолжностныеЛицаОбучениеИОПериод = ДолжностныеЛицаОбучениеИО.Период
		|			И (ДолжностныеЛицаОбучениеИО.ИО)
		|			И (ДолжностныеЛицаОбучениеИО.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДолжностныеЛицаОбучениеИО.ДатаОкончания >= ПериодыДолжностныхЛиц.ДатаОбучения)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДолжностныеЛица КАК ДолжностныеЛицаПроверкаЗнаний
		|		ПО ПериодыДолжностныхЛиц.ДолжностныеЛицаПроверкаЗнанийПериод = ДолжностныеЛицаПроверкаЗнаний.Период
		|			И (НЕ ДолжностныеЛицаПроверкаЗнаний.ИО)
		|			И (ДолжностныеЛицаПроверкаЗнаний.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДолжностныеЛицаПроверкаЗнаний.ДатаОкончания >= ПериодыДолжностныхЛиц.ДатаПроверкиЗнаний)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДолжностныеЛица КАК ДолжностныеЛицаПроверкаЗнанийИО
		|		ПО ПериодыДолжностныхЛиц.ДолжностныеЛицаПроверкаЗнанийИОПериод = ДолжностныеЛицаПроверкаЗнанийИО.Период
		|			И (ДолжностныеЛицаПроверкаЗнанийИО.ИО)
		|			И (ДолжностныеЛицаПроверкаЗнанийИО.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДолжностныеЛицаПроверкаЗнанийИО.ДатаОкончания >= ПериодыДолжностныхЛиц.ДатаПроверкиЗнаний)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОбучениеСотрудников.Номер КАК Номер,
		|	ОбучениеСотрудников.Дата КАК Дата,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
		|	ОбучениеСотрудников.ВидОбучения = ЗНАЧЕНИЕ(Перечисление.ВидыОбученийСотрудников.Первичное) КАК ВводныйИнструктаж,
		|	ОбучениеСотрудников.ВидПервичногоОбучения = ЗНАЧЕНИЕ(Перечисление.ВидыПервичногоОбученияСотрудников.ПриемНаРаботу) КАК ПриПриемеНаРаботу,
		|	ОбучениеСотрудников.ВидПервичногоОбучения = ЗНАЧЕНИЕ(Перечисление.ВидыПервичногоОбученияСотрудников.СменаПодразделения) КАК ПриСменеПодразделения,
		|	ОбучениеСотрудников.ВидОбучения = ЗНАЧЕНИЕ(Перечисление.ВидыОбученийСотрудников.Плановое) КАК ПлановыйИнструктаж,
		|	ОбучениеСотрудников.ВидОбучения = ЗНАЧЕНИЕ(Перечисление.ВидыОбученийСотрудников.Внеплановое) КАК ЦелевойИнструктаж,
		|	ОбучениеСотрудников.ТемаОбучения КАК ТемаОбучения
		|ПОМЕСТИТЬ _Шапка
		|ИЗ
		|	Документ.ОбучениеСотрудников КАК ОбучениеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(&Дата, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО ОбучениеСотрудников.Организация = РеквизитыЮридическихЛицАнкетныеСрезПоследних.Организация
		|			И ОбучениеСотрудников.Организация.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	ОбучениеСотрудников.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	0 КАК НомерСтроки,
		|	ПериодыРеквизитов.Сотрудник КАК Сотрудник,
		|	РеквизитыСотрудника.ФИО КАК ФИОСотрудника,
		|	СотрудникиОрганизации.Должность КАК Должность,
		|	СотрудникиОрганизации.Подразделение КАК Подразделение,
		|	ПериодыРеквизитов.ДатаОбучения КАК ДатаОбучения,
		|	ПериодыРеквизитов.ДолжностноеЛицоОбучение КАК ОтветственныйЗаОбучение,
		|	РеквизитыДолжностногоЛицаОбучение.ФИО КАК ФИООтветственногоЗаОбучение,
		|	СотрудникиОрганизацииДолжностноеЛицоОбучение.Должность КАК ДолжностьОтветственногоЗаОбучение,
		|	СотрудникиОрганизацииДолжностноеЛицоОбучение.Подразделение КАК ПодразделениеОтветственногоЗаОбучение,
		|	ПериодыРеквизитов.ДатаПроверкиЗнаний КАК ДатаПроверкиЗнаний,
		|	ПериодыРеквизитов.ДатаПроверкиЗнаний ЕСТЬ НЕ NULL  КАК ЗнанияСоответствуют,
		|	ПериодыРеквизитов.ДолжностноеЛицоПроверкаЗнаний КАК ОтветственныйЗаПроверкуЗнаний,
		|	РеквизитыДолжностногоЛицаПроверкаЗнаний.ФИО КАК ФИООтветственногоЗаПроверкуЗнаний
		|ПОМЕСТИТЬ _ЛистУчетаОбучения
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДолжностныеЛицаОбученияСотрудников.Сотрудник КАК Сотрудник,
		|		_ДолжностныеЛицаОбученияСотрудников.ДатаОбучения КАК ДатаОбучения,
		|		_ДолжностныеЛицаОбученияСотрудников.ДатаПроверкиЗнаний КАК ДатаПроверкиЗнаний,
		|		_ДолжностныеЛицаОбученияСотрудников.ДатаРеквизитов КАК ДатаРеквизитов,
		|		_ДолжностныеЛицаОбученияСотрудников.ДолжностноеЛицоОбучение КАК ДолжностноеЛицоОбучение,
		|		_ДолжностныеЛицаОбученияСотрудников.ДолжностноеЛицоПроверкаЗнаний КАК ДолжностноеЛицоПроверкаЗнаний,
		|		МАКСИМУМ(РеквизитыСотрудника.Период) КАК РеквизитыСотрудникаПериод,
		|		МАКСИМУМ(СотрудникиОрганизации.Период) КАК СотрудникиОрганизацииПериод,
		|		МАКСИМУМ(РеквизитыДолжностногоЛицаОбучение.Период) КАК РеквизитыДолжностногоЛицаОбучениеПериод,
		|		МАКСИМУМ(СотрудникиОрганизацииДолжностноеЛицоОбучение.Период) КАК СотрудникиОрганизацииДолжностноеЛицоОбучениеПериод,
		|		МАКСИМУМ(РеквизитыДолжностногоЛицаПроверкаЗнаний.Период) КАК РеквизитыДолжностногоЛицаПроверкаЗнанийПериод
		|	ИЗ
		|		_ДолжностныеЛицаОбученияСотрудников КАК _ДолжностныеЛицаОбученияСотрудников
		|			ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыСотрудников КАК РеквизитыСотрудника
		|			ПО _ДолжностныеЛицаОбученияСотрудников.Сотрудник = РеквизитыСотрудника.Сотрудник
		|				И _ДолжностныеЛицаОбученияСотрудников.ДатаРеквизитов >= РеквизитыСотрудника.Период
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации КАК СотрудникиОрганизации
		|			ПО _ДолжностныеЛицаОбученияСотрудников.Сотрудник = СотрудникиОрганизации.Сотрудник
		|				И _ДолжностныеЛицаОбученияСотрудников.ДатаРеквизитов >= СотрудникиОрганизации.Период
		|				И (СотрудникиОрганизации.Организация = &Организация)
		|			ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыСотрудников КАК РеквизитыДолжностногоЛицаОбучение
		|			ПО _ДолжностныеЛицаОбученияСотрудников.ДолжностноеЛицоОбучение = РеквизитыДолжностногоЛицаОбучение.Сотрудник
		|				И _ДолжностныеЛицаОбученияСотрудников.ДатаРеквизитов >= РеквизитыДолжностногоЛицаОбучение.Период
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации КАК СотрудникиОрганизацииДолжностноеЛицоОбучение
		|			ПО _ДолжностныеЛицаОбученияСотрудников.ДолжностноеЛицоОбучение = СотрудникиОрганизацииДолжностноеЛицоОбучение.Сотрудник
		|				И _ДолжностныеЛицаОбученияСотрудников.ДатаРеквизитов >= СотрудникиОрганизацииДолжностноеЛицоОбучение.Период
		|				И (СотрудникиОрганизацииДолжностноеЛицоОбучение.Организация = &Организация)
		|			ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыСотрудников КАК РеквизитыДолжностногоЛицаПроверкаЗнаний
		|			ПО _ДолжностныеЛицаОбученияСотрудников.ДолжностноеЛицоПроверкаЗнаний = РеквизитыДолжностногоЛицаПроверкаЗнаний.Сотрудник
		|				И _ДолжностныеЛицаОбученияСотрудников.ДатаРеквизитов >= РеквизитыДолжностногоЛицаПроверкаЗнаний.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ДолжностныеЛицаОбученияСотрудников.Сотрудник,
		|		_ДолжностныеЛицаОбученияСотрудников.ДатаОбучения,
		|		_ДолжностныеЛицаОбученияСотрудников.ДатаПроверкиЗнаний,
		|		_ДолжностныеЛицаОбученияСотрудников.ДатаРеквизитов,
		|		_ДолжностныеЛицаОбученияСотрудников.ДолжностноеЛицоОбучение,
		|		_ДолжностныеЛицаОбученияСотрудников.ДолжностноеЛицоПроверкаЗнаний) КАК ПериодыРеквизитов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыСотрудников КАК РеквизитыСотрудника
		|		ПО ПериодыРеквизитов.Сотрудник = РеквизитыСотрудника.Сотрудник
		|			И ПериодыРеквизитов.РеквизитыСотрудникаПериод = РеквизитыСотрудника.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации КАК СотрудникиОрганизации
		|		ПО ПериодыРеквизитов.Сотрудник = СотрудникиОрганизации.Сотрудник
		|			И ПериодыРеквизитов.СотрудникиОрганизацииПериод = СотрудникиОрганизации.Период
		|			И (СотрудникиОрганизации.Организация = &Организация)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыСотрудников КАК РеквизитыДолжностногоЛицаОбучение
		|		ПО ПериодыРеквизитов.ДолжностноеЛицоОбучение = РеквизитыДолжностногоЛицаОбучение.Сотрудник
		|			И ПериодыРеквизитов.РеквизитыДолжностногоЛицаОбучениеПериод = РеквизитыДолжностногоЛицаОбучение.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации КАК СотрудникиОрганизацииДолжностноеЛицоОбучение
		|		ПО ПериодыРеквизитов.ДолжностноеЛицоОбучение = СотрудникиОрганизацииДолжностноеЛицоОбучение.Сотрудник
		|			И ПериодыРеквизитов.СотрудникиОрганизацииДолжностноеЛицоОбучениеПериод = СотрудникиОрганизацииДолжностноеЛицоОбучение.Период
		|			И (СотрудникиОрганизацииДолжностноеЛицоОбучение.Организация = &Организация)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыСотрудников КАК РеквизитыДолжностногоЛицаПроверкаЗнаний
		|		ПО ПериодыРеквизитов.ДолжностноеЛицоПроверкаЗнаний = РеквизитыДолжностногоЛицаПроверкаЗнаний.Сотрудник
		|			И ПериодыРеквизитов.РеквизитыДолжностногоЛицаПроверкаЗнанийПериод = РеквизитыДолжностногоЛицаПроверкаЗнаний.Период";
#КонецОбласти	 	
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ИспользуютсяПростыеПодписи(Организация, ВидПеречня, Дата) Экспорт
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВидДолжностногоЛицаОтветственногоЗаОбучение(ВидПеречня, Отказ) Экспорт
	
	ВидДолжностногоЛица = Неопределено;
	
 	Если ВидПеречня = Справочники.ВидыПеречнейОбъектов.СотрудникиПроходящиеОбучениеПОДФТ Тогда
		ВидДолжностногоЛица = Перечисления.ВидыДолжностныхЛиц.СпециальноеДолжностноеЛицо;
		
	ИначеЕсли ВидПеречня = Справочники.ВидыПеречнейОбъектов.Инсайдеры Тогда
		ВидДолжностногоЛица = Перечисления.ВидыДолжностныхЛиц.Контролер;
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Для вида перечня %1 не задан вид ответственного лица", ВидПеречня),,,, Отказ);			
		
	КонецЕсли;
	
	Возврат ВидДолжностногоЛица;
	
КонецФункции
